org/_posts/2018-10-01-weird-humour-habits.org
#+STARTUP: showall indent
#+STARTUP: hidestars
#+OPTIONS: H:2 num:nil tags:nil toc:nil timestamps:nil
#+BEGIN_EXPORT html
---
layout: post
title: Common Humour Patterns of Mostly WEIRD Urban Minnesotans, Ages 22-30, Collected 2018-2019
categories: misc
---
#+END_EXPORT

* Common Humour Patterns of Mostly WEIRD Urban Minnesotans, Ages 22-35, Collected 2018-2019

Comedy patterns that play out in informal social settings, with a focus on patterns that invite active participation from the group beyond simple laughter.

** Sounds Funny
+ Funny noise, funny noise repeated, funny noise escalated (syllables elongated, substituted, switched around)
+ Word sounds unnatural or weird, word gets repeated, funniest parts of the word escalated (syllables elongated, substituted, switched around)

** "Bad"
(audience participation in the "badness" is invited)
+ Obvious pun
+ Clever pun
+ Hyperbole
+ Intentional Malaphor

** Bits
+ Physical bit with "chorus" echo, with repeating and variations, as the "Sounds Funny" category, above
+ Everyone is doing the same accent
+ Someone says something hyberbolic or otherwise absurd, onlookers "play along" as if it were true or maybe say "is that so?"

** Reminiscing
+ Recounting just the barest details of a funny scene from a television show or movie that most of the group has seen, someone else can chime in with a detail or free-associate to the next scene or another similar scene
+ Recounting just the barest details of a funny shared experience, participation through free association is also encouraged


/Continuous work in progress until 2020/
