jekyll/_posts/2018-10-01-weird-humour-habits.html
---
layout: post
title: Common Humour Patterns of Mostly WEIRD Urban Minnesotans, Ages 22-30, Collected 2018-2019
categories: misc
---

<div id="outline-container-org24afddd" class="outline-2">
<h2 id="org24afddd">Common Humour Patterns of Mostly WEIRD Urban Minnesotans, Ages 22-35, Collected 2018-2019</h2>
<div class="outline-text-2" id="text-org24afddd">
<p>
Comedy patterns that play out in informal social settings, with a focus on patterns that invite active participation from the group beyond simple laughter.
</p>
</div>

<div id="outline-container-org43c39a4" class="outline-3">
<h3 id="org43c39a4">Sounds Funny</h3>
<div class="outline-text-3" id="text-org43c39a4">
<ul class="org-ul">
<li>Funny noise, funny noise repeated, funny noise escalated (syllables elongated, substituted, switched around)</li>
<li>Word sounds unnatural or weird, word gets repeated, funniest parts of the word escalated (syllables elongated, substituted, switched around)</li>
</ul>
</div>
</div>

<div id="outline-container-org0342f44" class="outline-3">
<h3 id="org0342f44">"Bad"</h3>
<div class="outline-text-3" id="text-org0342f44">
<p>
(audience participation in the "badness" is invited)
</p>
<ul class="org-ul">
<li>Obvious pun</li>
<li>Clever pun</li>
<li>Hyperbole</li>
<li>Intentional Malaphor</li>
</ul>
</div>
</div>

<div id="outline-container-orga90a6be" class="outline-3">
<h3 id="orga90a6be">Bits</h3>
<div class="outline-text-3" id="text-orga90a6be">
<ul class="org-ul">
<li>Physical bit with "chorus" echo, with repeating and variations, as the "Sounds Funny" category, above</li>
<li>Everyone is doing the same accent</li>
<li>Someone says something hyberbolic or otherwise absurd, onlookers "play along" as if it were true or maybe say "is that so?"</li>
</ul>
</div>
</div>

<div id="outline-container-org8a4a84b" class="outline-3">
<h3 id="org8a4a84b">Reminiscing</h3>
<div class="outline-text-3" id="text-org8a4a84b">
<ul class="org-ul">
<li>Recounting just the barest details of a funny scene from a television show or movie that most of the group has seen, someone else can chime in with a detail or free-associate to the next scene or another similar scene</li>
<li>Recounting just the barest details of a funny shared experience, participation through free association is also encouraged</li>
</ul>


<p>
<i>Continuous work in progress until 2020</i>
</p>
</div>
</div>
</div>
